{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa:/home/carnd/behavioural_cloning/src/python/model_nvidia.py\u00da\b<lambda>\u0088\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape": null, "function_type": "lambda", "arguments": {}, "output_shape_type": "raw"}}, {"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[10, 10], [60, 30]], "name": "cropping2d_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 24, "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_1", "bias": true, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "trainable": true, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 36, "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_2", "bias": true, "nb_col": 5, "nb_row": 5, "b_regularizer": null, "trainable": true, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 48, "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_3", "bias": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "trainable": true, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 64, "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_4", "bias": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "trainable": true, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 64, "b_constraint": null, "subsample": [2, 2], "name": "convolution2d_5", "bias": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "trainable": true, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "input_dim": 1152, "trainable": true, "output_dim": 1164, "name": "dense_1", "W_regularizer": null, "activation": "elu", "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "input_dim": 1164, "trainable": true, "output_dim": 100, "name": "dense_2", "W_regularizer": null, "activation": "elu", "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "input_dim": 100, "trainable": true, "output_dim": 50, "name": "dense_3", "W_regularizer": null, "activation": "elu", "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "input_dim": 50, "trainable": true, "output_dim": 10, "name": "dense_4", "W_regularizer": null, "activation": "elu", "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "input_dim": 10, "trainable": true, "output_dim": 1, "name": "dense_5", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform"}}], "keras_version": "1.2.1"}